/*************************************************************************
	> File Name: whisper_view.c
	> Note: 
	> Created Time: 2015年08月20日 星期四 09时44分01秒
 ************************************************************************/

//int main()
int whisper_view(void)
{
    char username[MAXSIZE];
    system("clear");
    printf(" #   ###   #  #         #  #  ###########  ###########  ###########  ###########\n");
    printf(" #   # #   #  #         #  #  #            #         #  #            #         #\n");
    printf(" #   # #   #  #         #  #  #            #         #  #            #         #\n");
    printf(" #   # #   #  #         #  #  #            #         #  #            #         #\n");
    printf(" #   # #   #  ###########  #  ###########  ###########  ###########  ###########\n");
    printf(" #   # #   #  #         #  #            #  #            #            ###        \n");
    printf(" #   # #   #  #         #  #            #  #            #            #  ##      \n");
    printf(" #   # #   #  #         #  #            #  #            #            #    ##    \n");
    printf(" ##### #####  #         #  #  ###########  #            ###########  #      ####\n");
    PADDING_80
    NEWLINE
    printf("请输入对方用户名:");
    scanf("%s",username);
    whisper_control(char username[  ]);
}
